Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: །ཏད་ཡ་ཐཱ། སིད་དྷ་མ་ཏེ། བི་ལོ་ཀ་མ་ཏེ། ཨེ་ལེ་ཀེ་ཏེ་རེ་ཥེ། རཱུ་ཙི་སུ་རཱུ་ཙི། བུད་དྷེ་བི་བུད་དྷེ། མ་ཧཱ་བུད་དྷེ། ཨུན་མད་ཏེ། ཨུན་མད་ཏ། པྲ་ཏི་ཥེ་དྷ་ནེ། ར་ག་དྷུ་ར་ག་དྷུ་བ་པྲ་ཏི་ཥེ་དྷ་ནེ་བིན་དུ། བིན་དུ་མ་ཏེ། ཙི་ཊ་ཙི་ཊ་པྲ་ཏི་ཥེ་དྷ་ནི། ཨརྐ་ཙན་དྲ་ཨ་དྷེ། ཧ་ཏ་ཙིད་ཏི་ཧ་ཏ་ནི་རྨི། ཧ་ཏ་ཀཱ་མ་བེ་གེ །ཧ་ཏ་པཽ་ན་བྷ་བི་ར་ཛེ། ཧ་ཏ་ཙཀྵུ་ས་མ་ཏེ། ཧ་ཏ་བི་ཏ་མ་བུད་དྷེ། ཧ་ཏ་ཡཱ་གྲེ། ཧ་ཏ་བི་ས་མཱ་གྲེ། ཧ་ཏ་སུ་མུ་དྲ་ཙ་བེ། ཧ་ཏ་བི་ཏ་མཱ་ར་ཛེ། ཧ་ཏ་ཏི་ཏེ། ཧ་ཏ་དྷརྨ་ཙ་ཙ་ཏེ། ཧ་ཏ་དྷརྨ་རཱ་ཛེ། ཧ་ཏ་བ་ཧུ་རཱ་ཛེ། ཧ་ཏ་པ་བརྫ་མ་ཏི། ཧ་ཏཽགྷ་རབྨི། ཧ་ཏ་དྷརྨ་སིད་དྷི། ཧ་ཏ་སརྦ་ཨུ་པ་དྷ་ན་ཛྙཱ་ཛྙཱ་ཛྙཱ། བི་ཛྙཱ་ཛྙཱ་ཛྙཱ། རི་བི་ཛྙཱ་ཛྙཱ་ཛྙ། སརྦ་མཱརྒ་ཛྙ་ཛྙཱ། ཨེ་ཥ་ཨནྟ་སང་སཱ་ར་དུཿཁེ་སྭཱ་ཧཱ།
en: tadyathā: siddhamate vilokamate eleketereṣe rūcisurūci buddhevi­buddhe mahābuddhe unmadte unmadta pratiṣedhane ragadhura­gadhuva pratiṣedhane­bindu bindumate ciṭaciṭa­pratiṣedhani arkacandra adhe hatacid atihatanirmi hatakāmavege hatapauna­bhaviraje hatac kṣusamate hatavitama­buddhe hatayāgre hatavisamāgre hatasumudracave hata­vitamāraje hatatite hata­dharmacacate hata­dharmarāje hata­vahurāje hata­pavarjamati hataugharaśmi hata­dharmasiddhi hatasarva upadhana­jñājñājñā vijñājñājñā rivijñājñājña sarva­mārgajñajñā eṣa antasaṁsāra­duḥkhe svāhā.

source: རིགས་ཀྱི་བུ་འདོད་པའི་ཆུ་བོ་ཐམས་ཅད་ཀུན་ཏུ་སྐེམས་པར་བྱེད་པ། ངེས་པར་འབྱུང་བའི་ཕ་རོལ་དུ་འགྲོ་བའི་གཟུངས་སྔགས་འདི་བཟུང་ནས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་སོང་ཤིག །
en: “Noble son, remembering this dhāraṇī mantra that dries up all the rivers of desire and leads to the other shore of emancipation, proceed to the Sahā world!

source: ཁྱོད་ཀྱིས་འདོད་པའི་བདུད་ཀྱི་མཆིལ་པ་ཐམས་ཅད་དང་། ཕ་རོལ་གནོན་པ་དང་། ཡུལ་ལ་བརྩོན་པའི་ཕ་རོལ་གནོན་པས་ཕ་རོལ་གནོན་པ་བྱེད་དུ་ཟིན་ཀྱང་། སུས་ཀྱང་ཁྱོད་ཀྱི་ལུས་སམ་སེམས་ལ་འདོད་པའི་ཀུན་ཏུ་སྦྱོར་བ་དག་གིས་གོས་པར་བྱེད་མི་ནུས་ན་གཟུངས་སྔགས་འདི་ཇི་ལྟར་ཐོས་པ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་སོང་ནས་ཀྱང་སྦྱོར་བ་བྱོས་ཤིག །དེར་གལ་ཏེ་བདུད་བྱེ་བ་ཕྲག་བརྒྱ་གསང་སྔགས་ཀྱི་སྦྱོར་བ་ཐམས་ཅད་དང་། སྨན་གྱི་སྦྱོར་བ་ཐམས་ཅད་དང་། ཆོས་ཀྱི་སྦྱོར་བ་ཐམས་ཅད་དང་། ལྷ་དང་། མི་གཞན་དག་གིས་འདོད་པའི་དྲི་ང་བ་དག་གིས་གོས་པར་བྱ་བ་ལྟ་ཅི་སྨོས།
en: Since you have already overcome all the demonic hooks of desire through your courage and heroic exertion with the objects, no one is able to sully your body or mind with the fetters of desire. So go to the buddha realm of Sahā and apply this dhāraṇī mantra as you have heard it! In that place, surely none of the billions of māras will be able to sully you with the stench of desire through the use of any mantras, medicines, or doctrines—just as no god or human can do so!”

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། ལྷ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་དང་། ལྷ་དང་། མི་རྣམས་ངོ་མཚར་རྙེད་ཅིང་རྨད་དུ་བྱུང་བ་རྙེད་པར་གྱུར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment, the bodhisattva great being Quintessence of the Sun’s Energy and all the other myriads of bodhisattvas and divine beings as well as the gods and humans exclaimed with amazement and astonishment,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་གཟིགས་པ་དང་། མངའ་བརྙེས་པ་ནི་ངོ་མཚར་ལགས་སོ།
en: “The wisdom vision of the blessed buddhas and the level of mastery they have attained are amazing!

source: །མཆོག་ཏུ་ངོ་མཚར་ལགས་ཏེ།
en: They are truly amazing!

source: འདོད་པས་ཀུན་ཏུ་གདུང་བ་རྣམ་པར་འཇིག་པར་བགྱིད་པའི་གཟུངས་སྔགས་འདི་ནི་བདག་ཅག་གིས་སྔོན་མ་ཐོས་ལགས་སོ།
en: We have never before heard this dhāraṇī mantra that completely destroys the torments of desire!”

source: །དེ་ནས་འཁོར་དེར་ལྷའི་བུ་མོ་དང་། མིའི་བུ་མོ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་བསྙེན་བཀུར་བྱས་ནས་གཟུངས་སྔགས་འདི་ཐོས་པར་གྱུར་ཏོ།
en: Within the retinue, there were eighty-four thousand goddesses and girls who listened to this dhāraṇī mantra with reverence.

source: །ཐོས་མ་ཐག་ཏུ་དེ་དག་གི་མོ་མཚན་ནུབ་པར་གྱུར་ཅིང་། ཕོ་མཚན་བྱུང་བར་གྱུར་ཏེ། ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ།
en: As soon as they heard it their female genitals disappeared, they developed male genitals, and they all reached nonregression on the path to unsurpassed and perfect awakening.

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གིས་མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བ་བཞེས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The thus-gone Campaka Color then held up a garland of campaka flowers and said to the bodhisattva great being Quintessence of the Sun’s Energy,

source: །ཀྱེ་རིགས་ཀྱི་བུ་མེ་ཏོག་ཙམ་པ་ཀའི་ཕྲེང་བ་འདི་དང་། གཟུངས་སྔགས་ཉི་མ་སྣང་བའི་པད་མ་ཞེས་བྱ་བ་འདི་དང་། བདེན་པ་དང་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་དེ་ཟུང་ཤིག །
en: “O noble son, take this garland of campaka flowers along with the dhāraṇī mantra lotus of sunlight and the acceptance that accords with the truth.

source: འདོད་པ་གློག་གི་འོད་ལྟ་བུ་སེལ་བར་བྱེད་པ་འདི་གཉིས་དང་། ཆོས་ཀྱི་སྒོ་མོ་དེར་ཁྱེར་ལ་ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་གནོད་པ་ཆུང་ངམ། བསྐྱོད་པ་ཡང་ངམ། སྟོབས་དང་བདེ་བར་རེག་པ་ལ་གནས་སམ་ཞེས་ཀྱང་ཞུས་ལ།
en: Bring to that place those two dhāraṇīs which clear away desire like a flash of lightning, as well as the Dharma gateway. Once there, please convey my words to the thus-gone Śākyamuni and ask him if he has any ills or problems and whether he is healthy and well.

source: དེ་ལ་འདི་སྐད་དུ་ཁྱོད་ལ་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་ཞུ་བར་མཛད་ལགས་ཏེ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཅི་བསྙུང་བ་མི་མངའ་ལགས་སམ། གནོད་པ་ཆུང་ངམ།
en: Tell him ‘The thus-gone Campaka Color is inquiring whether you, respected Blessed One, are well and free from ills.

source: ཁྱོད་ཀྱི་འཁོར་གུས་པར་ཉན་ལགས་སམ།
en: Do the members of your retinue listen to you with respect?

source: ཆོས་འཚལ་བ་ལགས་སམ།
en: Are they eager for the Dharma?

source: ཆོས་ཀྱིས་གནས་པ་ལགས་སམ། ཆོས་ལ་བརྩོན་པ་ལགས་སམ།
en: Do they abide by the Dharma? Do they persevere in the Dharma?

source: སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ན་ཉོན་མོངས་པ་སེལ་བར་བགྱིད་པ་དེ་དག་དང་། ཆོས་ཀྱི་སྒོ་ལ་དེ་བཞིན་གཤེགས་པ་དེས་དད་པ་སྩལ་ཏེ།
en: That thus-gone one causes others to develop faith in those dhāraṇīs which clear away afflictions in all buddha regions, and in the Dharma gateway.

source: དེ་ནས་འདོད་པ་གློག་གི་འོད་ལྟ་བུ་སེལ་བར་བགྱིད་པ། ཆོས་ཀྱི་སྒོའི་གཟུངས་སྔགས་མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: He confers those powerful and beneficial dhāraṇī mantras—the Dharma gateways that clear away desire like a flash of lightning.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བགྱིད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཟད་པར་བགྱིད་པ་ནས། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་བར་བགྱིད་པ། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བགྱིད་པ་བསྐུར་ལགས་སོ་ཞེས་གསོལ་ཅིག། །།
en: They exhaust all forms of attachment associated with the desire realm and the form realm. [. . .] They overcome all the dense darkness of ignorance, and they remove the burden of suffering.’ ”

source: འཕགས་པ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་སྡེ་ཉི་མའི་སྙིང་པོ་ཞེས་བྱ་བའི་མདོ། བམ་པོ་གསུམ་པ། དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་འཚལ་ལགས་སོ།
en: The bodhisattva great being Quintessence of the Sun’s Energy replied, “Respected Blessed One, I shall do so!”

source: །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲིས་ཚིག་འཐུན་པར་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་བལྟ་བ་དང་། ཕྱག་བགྱི་བ་དང་། མཆོད་པ་དང་། བསྙེན་བཀུར་བགྱི་བ་དང་། འདུས་པ་ཆེན་པོ་དེ་ལ་ཡང་བལྟ་བའི་སླད་དུ། བདག་ཅག་ཀྱང་མཆི་བར་འཚལ་ཏེ།
en: Also, at that moment, eighty thousand bodhisattvas exclaimed in unison, “Respected Blessed One, we also wish to behold the thus-gone Śākyamuni, pay homage to him, worship him, revere him, and behold his great assembly, so we also wish to go.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལས་འདུས་པ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ན་ཉོན་མོངས་པ་སེལ་བར་བགྱིད་པའི་ཆོས་ཀྱི་སྒོ་བདག་ཅག་གིས་མཉན་པར་བགྱིད་ལགས་སོ།
en: From that thus-gone one we wish to hear The Great Assembly, the Dharma gateway that clears away afflictions in all the buddha regions!”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་དེས་དེ་དག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་དག་ཐམས་ཅད་ལྷན་ཅིག་འཐུན་པར་ཐམས་ཅད་ཚངས་པ་ཆེན་པོའི་ལུས་བྱད་དང་། རྟགས་དང་། མདོག་དང་། དབྱིབས་དང་། སྤྱོད་ལམ་གྱིས་དེང་ཤིག །
en: The thus-gone Campaka Color replied to them, “Noble sons, in that case, all of you proceed together while assuming the appearance, look, hue, shape, and behavior of mahābrahmās!”

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་མང་པོ་ཐམས་ཅད་ཚངས་པ་ཆེན་པོའི་ལུས་བྱད་དང་། མདོག་དང་། རྟགས་དང་། དབྱིབས་དང་། སྤྱོད་ལམ་དུ་ལུས་དག་མངོན་པར་སྤྲུལ་ནས།
en: At that moment, the bodhisattva Quintessence of the Sun’s Energy and all the myriads of other bodhisattvas emanated bodies with the appearance, look, hue, shape, and behavior of mahābrahmās.

source: དེ་བཞིན་གཤེགས་པ་ཙམ་པ་ཀའི་མདོག་གི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་དུ་བསྐོར་བ་བྱས་ནས་དེ་ནས་ཆས་ཏེ་ཡུད་ཙམ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདིར་ཕྱིན་ཏོ།
en: They prostrated to the feet of the thus-gone Campaka Color and circumambulated him three times. Then they departed, and in a single instant they arrived in the buddha realm of Sahā.

source: །སྐྱེས་བུ་དམ་པ་དེ་དག་ཕྱིན་པ་ཙམ་གྱི་མོད་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་འདི་ཐམས་ཅད་དུ་བཅོམ་ལྡན་འདས་ལ་མཆོད་པ་བྱ་བའི་ཕྱིར་མེ་ཏོག་ཙམ་པ་ཀའི་ཆར་མངོན་པར་འབེབས་པར་གྱུར་ཏོ།
en: Immediately upon arriving, those sacred beings showered a rain of campaka flowers everywhere in the buddha realm of Sahā in order to worship the Blessed One.

source: །དེ་དག་ཡུལ་མ་ག་དྷཱའི་ཞིང་ག་ལ་བ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ག་ལ་བ་དེར་ཉེ་བར་དོང་ངོ་།
en: They then proceeded toward Magadha and the place where the blessed thus-gone Śākyamuni was residing.

source: །དོང་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: When they arrived there, they prostrated to the feet of the Blessed One and sat to one side.

source: །བཅོམ་ལྡན་འདས་ནི་དེའི་བར་དུ་ཡང་རྒྱལ་པོ་གཟུགས་ཅན་སྙིང་པོ་དང་ཐབས་ཅིག་ཆོས་ཀྱིས་གནས་པའི་གཏམ་ཀུན་ཏུ་སྤྱོད་པར་མཛད་དོ།
en: Up to that moment, the Blessed One had been engaged in a discourse with King Bimbisāra about how to abide by the Dharma.

source: །དེའི་ཚེ་ལྷོ་ཕྱོགས་ན་གྲོང་ཁྱེར་ཆུ་དང་རྒྱར་དཔག་ཚད་གཅིག་ཡོད་པ་བྱེ་མ་དག་གིས་ཡོངས་སུ་གང་བ་དེ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྙིགས་མ་ལྔས་སྙིགས་མའི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཡོད་དེ། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་དབང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: At that time, in the southern direction, beyond buddha realms as numerous as the grains of sand needed to fill a city one league square, there was a world ripe with the five degenerations called Banner of Degeneration, where the thus-gone, worthy, perfect Buddha King of the Lord of Mountains was residing. He thrived, lived well, and taught the Dharma.

source: །འཁོར་དེར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་ཞེས་བྱ་བ་འདུས་ཏེ་འདུག་པར་གྱུར་ཏོ།
en: At that point there was a bodhisattva great being named Gandhahastin present in his assembly.

source: །དེས་སྟེང་གི་ནམ་མཁའ་ལ་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་ལྷོ་ཕྱོགས་ཀྱི་ཕྱོགས་ཆ་ནས་བྱང་ཕྱོགས་སུ་འགྲོ་བ་དག་མཐོང་ངོ་། །དེ་ནས་གོང་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་འདོང་བའི་ཕྱོགས་དེ་ལ་བལྟས་ཏེ།
en: In the sky above he saw an innumerable and limitless number of bodhisattvas departing from the south and proceeding toward the north.

source: དེས་དེར་སྣང་བ་ཆེན་པོ་མཐོང་ནས་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་ལ་ཡོངས་སུ་ཞུས་སོ་ཞེས་བྱ་བ་ནས།
en: As he looked in the direction in which those bodhisattva great beings were going, he saw a brilliant light.

source: དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ་ཞེས་བྱ་བའི་བར་སྔ་མ་བཞིན་ནོ།
en: He then questioned the thus-gone King of the Lord of Mountains, who replied to him in the same way as before:

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། གྲོང་ཁྱེར་ཆུ་དང་རྒྱར་དཔག་ཚད་གཅིག་ཡོད་པ་བྱེ་མ་དག་གིས་ཡོངས་སུ་གང་བར་གྱུར་པའི་བྱེ་མའི་འབྲུ་དེ་དག་ཇི་སྙེད་ཡོད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཇི་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་ཅེས་བྱ་བ་ཡོད་དོ། །དེ་ན་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཏོ།
en: “Noble son, beyond buddha realms as numerous as the grains of sand needed to fill a city one league square, there is a world called Sahā, where the thus-gone Śākyamuni resides. He thrives, lives well, and teaches the Dharma.

source: །དེ་ན་ད་ལྟར་འདུས་པ་ཆེན་པོ་ཡོད་དེ། དེ་ན་དེ་བཞིན་གཤེགས་པ་དེ་ཆོས་ཀྱི་ཚུལ་ཡུན་རིང་དུ་གནས་པར་མཛད་པའི་ཕྱིར་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་རྒྱུན་མི་གཅད་པའི་ཕྱིར་དང་། ཆོས་ཀྱིས་གནས་པ་ཉིད་རྒྱུན་མི་གཅད་པའི་ཕྱིར་དང་། བདུད་ཀྱི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་རྒྱལ་མཚན་བསྒྲེང་བར་མཛད་པའི་ཕྱིར་ཐེག་པ་གསུམ་རྣམ་པར་གཏན་ལ་དབབ་པ་བསྟན་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་རབ་ཏུ་སྟོན་ཏོ།
en: In that place, there is now a great assembly in which that thus-gone one reveals Dharma teachings that are the gateways to the ascertainment of the three vehicles, in order to ensure that the Dharma way remains for a long time, to ensure that the lineage of the Three Jewels remains uninterrupted, to ensure that those who abide by the Dharma remain without interruption, to destroy the domain of the māras, and to raise the banner of the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རིན་པོ་ཆེའི་ཏོག་ཅེས་བྱ་བའི་གཟུངས་སྔགས་བཤད་ནས་གཤེགས་སོ་ཞེས་བྱ་བ་ནས།
en: There, all the thus-gone ones have recited the dhāraṇī mantra called jewel crest and then left.

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་འདུས་པ་ཆེན་པོ་ཡང་དག་པར་འདུས་པར་མཛད་ནས་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་ལྡན་པའི་སྤྱན་གསུམ་དང་། ཚངས་པའི་གནས་དག་བསྟན་ཀྱང་ད་དུང་འཁོར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་ས་དང་སྟེང་གི་ནམ་མཁའ་མ་འདྲེས་པར་གང་ཞིག་དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་སྙན་པ་གསུང་བ་ཤཱཀྱ་ཐུབ་པའི་ཆོས་བསྟན་པ་ལ་ངོམས་པ་མེད་དོ་ཞེས་བྱ་བའི་བར་ཇི་སྐད་སྔར་གསུངས་པ་བཞིན་ནོ།
en: The thus-gone Śākyamuni has gathered a great assembly of bodhisattva great beings and hearers who possess the three eyes that are endowed with the four correct knowledges and who display the sublime states. This retinue distinctly fills the earth and the sky of the buddha realm of Sahā, and it is insatiable with respect to the Dharma teachings of the thus-gone Śākyamuni, who is endowed with the most delightful voice.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཞུ་བའི་ཕྱིར་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་བར་སྤྲོ་ན་དེར་ཉི་མའི་ཤུགས་ཀྱི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་ལ་ངས་དད་པ་སྦྱིན་པར་མཛད་དོ།
en: “Noble son, if you would like to bring my words to the Sahā world in order to convey them to the thus-gone Śākyamuni, there these words of mine will instill faith in the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the domain of the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings.

source: །དེར་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: There, I will confer this powerful and beneficial dhāraṇī mantra that accords with emptiness.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་མེད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། ང་རྒྱལ་དང་། ལྷག་པའི་ང་རྒྱལ་དང་། ངའོ་སྙམ་པའི་ང་རྒྱལ་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས་ཟད་པ་ཤེས་པ་སྐྱེད་པའི་བར་བྱེད་པ། མི་སྐྱེ་བ་ཤེས་པ་རྟོག་པར་བྱེད་པ། མ་རིག་པའི་མུན་པའི་ཕུང་པོ་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པར་བྱེད་པ། སྡུག་བསྔལ་གྱི་ཁུར་ཐམས་ཅད་འདོར་བར་བྱེད་པ་འདི་བསྐུར་བར་མཛད་དོ། །
en: It exhausts all forms of attachment associated with the desire realm, the form realm, and the formless realm, as well as all forms of pride, special pride, and pride that thinks ‘I am.’ [. . .] It generates the knowledge of exhaustion, causes one to realize the knowledge of the unborn, overcomes all the dense darkness of ignorance, and removes the entire burden of suffering.

source: ཏད་ཡ་ཐཱ། དྷུ་མ་ཏེ། དྷུ་མ་ཏེ། ཨཀྵི་དྷུ་མ་ཏེ། པྲ་བྷཱ་ས་དྷུ་མ་ཏེ། སརྦཱ་ཀཱ་ཤ་དྷུ་མ་ཏེ། ཨ་བ་བཱི་ཀྵ་ཁ་ག །བི་མཱ་ན་ཁ་ག །ཨ་བ་མོ་ཧ་ཁ་ག །ཨ་ན་ནྱ་ཁ་ག །བྱ་བ་བྲིད་ཏི་ཁ་ག །ཨ་རོ་ཙ་ན་ཁ་ག །ཨ་ནི་མཱ་ཁ་ག །ལོ་ཀ་ཁ་ག །ཤི་ཁི་ཁ་ག །པི་ཏི་མི་ར་ཁ་ག །ན་མོ་ཁ་ག །ཨཀྵི་ཁ་ག །ཤྲོ་ཏྲ་ཁ་ག །གྷྲཱ་ཎ་ཁ་ག །ཛི་ཧྭཱ་ཁ་ག །ཀཱ་ཡ་ཁ་ག །མ་ན་ཁ་ག །རཱུ་པ་ཁ་ག །ཤཔྟ་ཁ་ག །གནྡྷ་ཁ་ག །ར་ས་ཁ་ག །སྤརྴ་ཁ་ག །དྷརྨ་ཁ་ག །ཙཀྵུ་རྡྷཱ་ཏུ་ཁ་ག །རཱུ་པ་དྷཱ་ཏུ་ཁ་ག །ཙཀྵུརྦི་ཛྙཱ་ན་དྷཱ་ཏུ་ཁ་ག །ཡཱ་པད་མ་ན་དྷཱ་ཏུ་ཁ་ག །དྷརྨ་དྷཱ་ཏུ་ཁ་ག །མན་བི་ཛྙཱ་ན་དྷཱ་ཏུ་ཁ་ག །པྲིཐྭཱིདྷཱ་ཏུ་ཁ་ག །ཨ་པ་དྷཱ་ཏུ་ཁ་ག །ཏེ་ཛོ་དྷཱ་ཏུ་ཁ་ག །བཱ་ཡུདྷཱ་ཏུ་ཁ་ག །ཙ་ཏུ་ར་ཨ་ནུ་སྨྲྀཏྱུ་པ་སྠཱ་ན་ཁ་ག །ཡཱ་བ་ད་བེ་ཎི་ཀ་ཁ་ག །ཡཱ་བད་མཱརྒ་ཁ་ག །ཨ་བྷིཀྵི་པ། ཨ་ན་ན་ན། བ་ན་ན། ས་མུ་དྲ་ན་ན། སརྦ་ཀ་ར་ན་ན། སརྦ་སཾ་སྐ་ར་བི་ཤེ་ཥ་ན་ན། ཨ་ཀིན་ཙ་ན་ན་ན། ཀྵ་ཏ་ཀྵ་ཏ། ཨི་ལི་མི་ལི། ཨི་ཨི་ཨི་ཨི་ལི་མི་ལེ་སྭཱ་ཧཱ།
en: tadyathā: dhumate dhumate akṣidhumate prabhāsadhumate sarvākāśa­dhumate avavīkṣakhaga vimānakhaga avamohakhaga ananyakhaga vyavavṛdatikhaga arocanakhaga animākhaga lokakhaga śikhikhaga vitimirakhaga namokhaga akṣikhaga śrotrakhaga ghrāṇakhaga jihvākhaga kāyakhaga manakhaga rūpakhaga śaptakhaga gandhakhaga rasakhaga sparśakhaga dharmakhaga cakṣurdhātukhaga rūpadhātukhaga cakṣurvijñānadhātukhaga yāpadmana­dhātukhaga dharma­dhātukhaga manvijñāna­dhātukhaga pṛthavīdhātukhaga apadhātukhaga tejodhātukhaga vāyudhātukhaga caturanusmṛtyupasthānakhaga yāvadveṇikakhaga yāvadmārgakhaga abhikṣipa ananana vanana samudranana sarvakaranana sarva­saṃskara­viśeṣanana akinacananana kṣatakṣata ilimili iiiilimile svāhā.

source: རིགས་ཀྱི་བུ་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་དེ་ནི་འདི་ཡིན་ཏེ།
en: “Noble son, this is the dhāraṇī mantra that accords with emptiness.

source: མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: It is very powerful and beneficial.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས། སྡུག་བསྔལ་གྱི་ཁུར་འདོར་བར་བྱེད་པའི་བར་ཡིན་ནོ།
en: It exhausts all forms of attachment associated with the desire realm and the form realm, and [. . .] it removes the burden of suffering.

source: །ལོང་ལ་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་སོང་ཤིག །
en: Arise, and go to the buddha realm of Sahā!

source: ངའི་བཀས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ལ་གནོད་པ་ཆུང་ངམ་ཞེས་བྱ་བ་ནས། གང་ལ་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་འདིར་ཆོས་མ་ལགས་པའི་འཁོར་ལོ་བསྐོར་བ་དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་དེས་ཉི་མའི་སྙིང་པོའི་ཆོས་ཀྱིས་གནས་པ་ཀླུའི་ཡུལ་རྣམ་པར་འཇིག་པར་མཛད་པའི་འོད་ཟེར་གྱི་ལེའུ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ལས་ཟད་པར་འགྱུར་བའི་གཟུངས་སྔགས་འདི་ལ་དད་པ་སྩོལ་བར་མཛད་ཅིང་ཞེས་བྱ་བའི་བར་དང་། དེ་ནས་ཀྱང་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་མཐུ་སྟོབས་ཆེ་བ། ཕན་ཡོན་ཆེ་བ།
en: Present my words to the thus-gone Śākyamuni and ask him if he has any ills. [. . .] For those who turn a wheel of non-Dharma in this buddha realm, the thus-gone King of the Lord of Mountains instills faith by granting the practice of the Dharma of The Quintessence of the Sun, the section on the light rays that destroy the nāgas, the dhāraṇī mantra that exhausts the karmic actions of sentient beings. He confers this powerful and beneficial dhāraṇī mantra that accords with emptiness.

source: འདོད་པའི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ། གཟུགས་ཀྱི་འདོད་ཆགས་ཐམས་ཅད་ཀུན་ཏུ་ཟད་པར་བྱེད་པ་ཞེས་བྱ་བ་ནས། སྡུག་བསྔལ་གྱི་ཁུར་ཐམས་ཅད་འདོར་བར་བྱེད་པ་འདི་བསྐུར་ལགས་སོ་ཞེས་བྱ་བའི་བར་སྔ་མ་བཞིན་ནོ།
en: It exhausts all forms of attachment associated with the desire realm and the form realm, and [. . .] it removes the entire burden of suffering.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སྟོང་པ་ཉིད་དང་རྗེས་སུ་འཐུན་པའི་གཟུངས་སྔགས་ཀྱི་ཡོན་ཏན་གྱི་ཕན་ཡོན་དང་། སྟོང་པ་ཉིད་ཀྱི་ཕན་ཡོན་བདག་གིས་བཟུང་ལགས་ན་བཙུན་པ་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེར་མཆི་བ་ལ་བདག་འཇིགས་ལགས་སོ།
en: The bodhisattva great being Gandhahastin said, “Respected Blessed One, when I consider the benefits of the qualities and emptiness that are related to this dhāraṇī mantra that accords with emptiness, I am afraid to go to the buddha realm of Sahā!

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is it so, respected Blessed One?

source: ད་ལྟར་བཅོམ་ལྡན་འདས་ལས་བདག་གིས་མངོན་དུ་ཐོས་ཤིང་མངོན་དུ་བཟུང་ལགས་ཏེ།
en: Because I have heard and understood what the Blessed One said:

source: འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དེ་ན་སེམས་ཅན་རྣམས་མཆོག་ཏུ་འདོད་ཆགས་ཀྱི་ཤས་ཆེ་བ་ཞེས་བགྱི་བ་ནས། བུད་མེད་ཀྱི་ཉེས་པས་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཉམས་པ་དག་དང་། ངན་སོང་བ་དག་དང་། སེམས་ཅན་དམྱལ་བ་པའི་བར་འབྱུང་ཞིང་འབྱུང་བར་འགྱུར་བའི་བར་གྱི་སླད་དུའོ།
en: that in that buddha realm of Sahā, sentient beings are predominantly under the influence of intense desire; [. . .] due to the faults of women, all beings’ roots of virtue will deteriorate, and they will go to the lower realms and be born as hell beings.”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The thus-gone King of the Lord of Mountains then said to the bodhisattva great being Gandhahastin,

source: ནམ་མཁའ་ལ་རྐྱེན་གསུམ་ཡོད་དེ། གསུམ་གྱིས་ཁྱབ་པས་རྣམ་པར་མཛེས་སོ། །གངས་ནི་གདུང་བར་མི་བྱེད་དོ། །ཆུ་ཀླུང་དག་ལ་ཆུ་སྐམ་པར་མི་འགྱུར་རོ།
en: “The sky has three conditions. Due to those three conditions, it is always beautiful, it is unafflicted by snow, and it does not dry up the rivers.

source: །རྐྱེན་གསུམ་པ་དག་ལ་མཁས་པ་དང་། བཟོད་པ་དང་། བསྡམས་པས་ལུས་ཁྱབ་པ་ནི་ལུང་གིས་མ་རིག་པའི་ཆུ་བོས་ཀྱང་དབང་པོ་དྲུག་གདུང་བར་མི་བྱེད་དོ། །བྱིས་པས་སྨྲས་པ།
en: When the body has three conditions present—expertise, acceptance, and restraint—the stormy river of ignorance will not afflict the six sense faculties. You are speaking like a child.

source: རྐྱེན་གསུམ་གྱིས་ཆུ་བོ་དག་ལས་ཐར་བར་བྱེད་ཅིང་སེམས་ཅན་མེད་པ་དང་། ཕུང་པོའི་ཁུར་འདོར་བའི་ཆོས་སྟོན་པར་བྱེད་དོ།
en: Because of those three circumstances you are liberated from all rivers. These three circumstances reveal the nonexistence of sentient beings and the Dharma that removes the burden of the aggregates.

source: །ཁྱོད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རྣམ་པ་བཅུ་གསུམ་རབ་ཏུ་བསྒོམས་པ་ཡིན་ཞིང་འཇིགས་པ་ཐམས་ཅད་སྤངས་པ་ཡིན་ན། ཅིའི་ཕྱིར་ཁྱོད་འཇིགས་སོ་ཞེས་སྨྲ་བར་བྱེད།
en: You have cultivated the thirteen types of acceptance of the unborn nature of phenomena and abandoned all fears, so why do you say that you are afraid?

source: ཁ་ཅིག་ཏུ་ནི་ཁྱོད་ཚངས་པའི་ལུས་བྱད་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་དག་ན་སེམས་ཅན་རྣམས་ཐར་བར་བྱེད་དོ།
en: Sometimes you assume the physical form of Brahmā to liberate beings in other buddha realms.

source: །ཁ་ཅིག་ཏུ་ནི་དབང་ཕྱུག་ཆེན་པོ་དང་། ཁ་ཅིག་ཏུ་ནི་བརྒྱ་བྱིན་དང་། ཁ་ཅིག་ཏུ་ནི་སྲེད་མེད་ཀྱི་བུ་དང་། ཁ་ཅིག་ཏུ་ནི་ལྷའི་ལུས་བྱད་དང་། ཁ་ཅིག་ཏུ་ནི་གནོད་སྦྱིན་དང་། ཀླུའི་དབང་པོ་དང་། ལྷ་མ་ཡིན་དང་། ཁ་ཅིག་ཏུ་ནི་འཁོར་ལོས་སྒྱུར་བའི་ལུས་བྱད་དང་། ཁ་ཅིག་ཏུ་ནི་སྨན་པའི་ལུས་བྱད་དང་། རྒྱལ་རིགས་ཀྱི་ལུས་བྱད་དང་། དེ་བཞིན་དུ་ཁ་ཅིག་ཏུ་ནི་བྲམ་ཟེའི་ལུས་བྱད་དང་། ཁ་ཅིག་ཏུ་ནི་ཉན་ཐོས་ཀྱི་ལུས་བྱད་དང་ཞེས་བྱ་བ་ནས། ཁ་ཅིག་ཏུ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་མང་པོར་བློན་པོའི་བར་གྱི་ལུས་བྱད་དུ་ཀུན་ཏུ་སྣང་བར་བྱེད་དེ།
en: At other times you manifest in many other buddha realms, in the physical forms of Maheśvara, Śakra, Nārāyaṇa, gods, yakṣas, lords of the nāgas, asuras, universal monarchs, doctors, members of the kṣatriya class, brāhmaṇas, hearers, [. . .] or ministers.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཉོན་མོངས་པ་ཅན་དག་ཏུ་དུས་རྟག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་ཡིན་ན་ཅི་སྟེ་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་དོན་དུ་འཇིགས་པའི་ཚིག་སྨྲ་བར་བྱེད།
en: You constantly manifest within afflicted buddha realms to purify buddha realms, so why do you say that you are afraid of ripening sentient beings?
